; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Domain file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain grid)
    (:requirements :equality :typing)
    (:types
        place - object
        shape - object
        key - object
        object
    )

    (:constants
        
    )

    (:predicates
        (conn ?x1 - place ?x2 - place)
        (key-shape ?x1 - key ?x2 - shape)
        (lock-shape ?x1 - place ?x2 - shape)
        (at ?x1 - key ?x2 - place)
        (at-robot ?x1 - place)
        (locked ?x1 - place)
        (carrying ?x1 - key)
        (open ?x1 - place)
    )

    (:functions
        
    )

    

    
    (:action unlock
     :parameters (?curpos - place ?lockpos - place ?key - key ?shape - shape)
     :precondition (and (conn ?curpos ?lockpos) (key-shape ?key ?shape) (lock-shape ?lockpos ?shape) (at-robot ?curpos) (locked ?lockpos) (carrying ?key))
     :effect (and
        (open ?lockpos)
        (not (locked ?lockpos)))
    )


    (:action move
     :parameters (?curpos - place ?nextpos - place)
     :precondition (and (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
     :effect (and
        (at-robot ?nextpos)
        (not (at-robot ?curpos)))
    )


    (:action pickup
     :parameters (?curpos - place ?key - key)
     :precondition (and (at-robot ?curpos) (at ?key ?curpos))
     :effect (and
        (carrying ?key)
        (not (at ?key ?curpos)))
    )

)

; problem
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; Instance file automatically generated by the Tarski FSTRIPS writer
;;; 
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (problem ipc-grid-10-10-10)
    (:domain grid)

    (:objects
        key_0 key_1 key_10 key_11 key_12 key_13 key_14 key_15 key_16 key_17 key_18 key_19 key_2 key_20 key_21 key_22 key_23 key_3 key_4 key_5 key_6 key_7 key_8 key_9 - key
        place_0_0 place_0_1 place_0_2 place_0_3 place_0_4 place_0_5 place_0_6 place_0_7 place_0_8 place_0_9 place_1_0 place_1_1 place_1_2 place_1_3 place_1_4 place_1_5 place_1_6 place_1_7 place_1_8 place_1_9 place_2_0 place_2_1 place_2_2 place_2_3 place_2_4 place_2_5 place_2_6 place_2_7 place_2_8 place_2_9 place_3_0 place_3_1 place_3_2 place_3_3 place_3_4 place_3_5 place_3_6 place_3_7 place_3_8 place_3_9 place_4_0 place_4_1 place_4_2 place_4_3 place_4_4 place_4_5 place_4_6 place_4_7 place_4_8 place_4_9 place_5_0 place_5_1 place_5_2 place_5_3 place_5_4 place_5_5 place_5_6 place_5_7 place_5_8 place_5_9 place_6_0 place_6_1 place_6_2 place_6_3 place_6_4 place_6_5 place_6_6 place_6_7 place_6_8 place_6_9 place_7_0 place_7_1 place_7_2 place_7_3 place_7_4 place_7_5 place_7_6 place_7_7 place_7_8 place_7_9 place_8_0 place_8_1 place_8_2 place_8_3 place_8_4 place_8_5 place_8_6 place_8_7 place_8_8 place_8_9 place_9_0 place_9_1 place_9_2 place_9_3 place_9_4 place_9_5 place_9_6 place_9_7 place_9_8 place_9_9 - place
        shape_0 shape_1 shape_10 shape_11 shape_12 shape_13 shape_14 shape_15 shape_16 shape_17 shape_18 shape_19 shape_2 shape_20 shape_21 shape_22 shape_23 shape_3 shape_4 shape_5 shape_6 shape_7 shape_8 shape_9 - shape
    )

    (:init
        (at-robot place_0_0)
        (conn place_8_2 place_9_2)
        (conn place_5_3 place_5_2)
        (conn place_2_8 place_2_7)
        (conn place_9_2 place_8_2)
        (conn place_0_4 place_0_3)
        (conn place_8_2 place_8_3)
        (conn place_3_1 place_3_2)
        (conn place_2_3 place_2_4)
        (conn place_7_7 place_7_8)
        (conn place_7_5 place_7_4)
        (conn place_9_6 place_9_7)
        (conn place_0_8 place_1_8)
        (conn place_4_1 place_4_0)
        (conn place_2_5 place_2_6)
        (conn place_5_8 place_5_7)
        (conn place_4_0 place_5_0)
        (conn place_3_1 place_3_0)
        (conn place_1_1 place_1_2)
        (conn place_7_8 place_7_7)
        (conn place_7_6 place_7_5)
        (conn place_9_1 place_9_2)
        (conn place_7_3 place_7_4)
        (conn place_0_0 place_0_1)
        (conn place_0_2 place_1_2)
        (conn place_8_1 place_8_2)
        (conn place_3_2 place_3_1)
        (conn place_6_7 place_6_8)
        (conn place_8_1 place_8_0)
        (conn place_4_6 place_5_6)
        (conn place_1_1 place_0_1)
        (conn place_4_3 place_4_4)
        (conn place_5_4 place_5_5)
        (conn place_6_5 place_6_6)
        (conn place_7_7 place_7_6)
        (conn place_8_9 place_8_8)
        (conn place_9_0 place_8_0)
        (conn place_4_6 place_4_5)
        (conn place_5_4 place_4_4)
        (conn place_3_3 place_3_4)
        (conn place_9_3 place_9_2)
        (conn place_0_7 place_0_8)
        (conn place_0_2 place_0_1)
        (conn place_3_0 place_3_1)
        (conn place_9_4 place_9_3)
        (conn place_2_4 place_2_5)
        (conn place_7_3 place_6_3)
        (conn place_4_6 place_4_7)
        (conn place_0_8 place_0_7)
        (conn place_5_1 place_5_0)
        (conn place_6_6 place_6_5)
        (conn place_2_0 place_1_0)
        (conn place_0_5 place_0_6)
        (conn place_2_7 place_2_6)
        (conn place_5_5 place_5_4)
        (conn place_8_5 place_8_4)
        (conn place_3_5 place_3_4)
        (conn place_4_9 place_4_8)
        (conn place_1_2 place_0_2)
        (conn place_5_8 place_5_9)
        (conn place_4_8 place_4_7)
        (conn place_0_7 place_0_6)
        (conn place_7_6 place_6_6)
        (conn place_4_7 place_4_6)
        (conn place_3_7 place_3_6)
        (conn place_6_6 place_7_6)
        (conn place_8_2 place_8_1)
        (conn place_1_8 place_0_8)
        (conn place_4_1 place_4_2)
        (conn place_8_4 place_8_5)
        (conn place_9_5 place_9_4)
        (conn place_7_2 place_7_3)
        (conn place_5_0 place_5_1)
        (conn place_3_3 place_3_2)
        (conn place_3_6 place_3_5)
        (conn place_6_1 place_6_0)
        (conn place_6_2 place_7_2)
        (conn place_2_7 place_2_8)
        (conn place_4_4 place_4_5)
        (conn place_5_0 place_6_0)
        (conn place_5_9 place_5_8)
        (conn place_4_4 place_4_3)
        (conn place_1_4 place_1_5)
        (conn place_3_0 place_4_0)
        (conn place_7_2 place_6_2)
        (conn place_3_0 place_2_0)
        (conn place_3_4 place_3_5)
        (conn place_2_6 place_2_7)
        (conn place_7_8 place_7_9)
        (conn place_9_9 place_9_8)
        (conn place_9_8 place_9_9)
        (conn place_8_0 place_7_0)
        (conn place_0_9 place_0_8)
        (conn place_5_7 place_5_6)
        (conn place_1_6 place_1_5)
        (conn place_6_5 place_6_4)
        (conn place_8_6 place_8_5)
        (conn place_2_1 place_3_1)
        (conn place_0_1 place_0_0)
        (conn place_2_8 place_2_9)
        (conn place_8_0 place_9_0)
        (conn place_9_8 place_9_7)
        (conn place_5_0 place_4_0)
        (conn place_1_0 place_2_0)
        (conn place_5_3 place_5_4)
        (conn place_7_1 place_7_0)
        (conn place_8_7 place_8_6)
        (conn place_7_1 place_7_2)
        (conn place_0_3 place_1_3)
        (conn place_6_4 place_6_5)
        (conn place_4_5 place_4_6)
        (conn place_9_3 place_9_4)
        (conn place_2_8 place_3_8)
        (conn place_5_2 place_5_1)
        (conn place_8_3 place_8_2)
        (conn place_6_7 place_6_6)
        (conn place_2_2 place_2_3)
        (conn place_8_8 place_9_8)
        (conn place_0_0 place_1_0)
        (conn place_3_7 place_3_8)
        (conn place_5_4 place_5_3)
        (conn place_0_6 place_1_6)
        (conn place_4_5 place_4_4)
        (conn place_8_7 place_8_8)
        (conn place_8_8 place_8_7)
        (conn place_2_3 place_2_2)
        (conn place_6_8 place_6_9)
        (conn place_1_6 place_1_7)
        (conn place_8_4 place_8_3)
        (conn place_1_8 place_1_7)
        (conn place_8_4 place_9_4)
        (conn place_9_7 place_8_7)
        (conn place_0_1 place_0_2)
        (conn place_2_6 place_3_6)
        (conn place_1_0 place_1_1)
        (conn place_7_6 place_7_7)
        (conn place_0_5 place_0_4)
        (conn place_6_2 place_6_1)
        (conn place_7_7 place_6_7)
        (conn place_9_6 place_9_5)
        (conn place_2_1 place_2_0)
        (conn place_5_6 place_5_7)
        (conn place_0_8 place_0_9)
        (conn place_1_4 place_1_3)
        (conn place_9_2 place_9_3)
        (conn place_1_3 place_0_3)
        (conn place_1_6 place_0_6)
        (conn place_5_1 place_5_2)
        (conn place_4_0 place_4_1)
        (conn place_6_9 place_6_8)
        (conn place_9_5 place_9_6)
        (conn place_4_0 place_3_0)
        (conn place_1_5 place_1_4)
        (conn place_5_2 place_5_3)
        (conn place_6_0 place_7_0)
        (conn place_7_3 place_7_2)
        (conn place_7_9 place_7_8)
        (conn place_1_2 place_1_1)
        (conn place_7_0 place_8_0)
        (conn place_5_6 place_4_6)
        (conn place_8_0 place_8_1)
        (conn place_2_9 place_2_8)
        (conn place_2_3 place_3_3)
        (conn place_7_5 place_6_5)
        (conn place_0_6 place_0_5)
        (conn place_5_6 place_5_5)
        (conn place_8_7 place_9_7)
        (conn place_1_8 place_1_9)
        (conn place_1_7 place_1_6)
        (conn place_1_2 place_1_3)
        (conn place_2_2 place_2_1)
        (conn place_2_5 place_2_4)
        (conn place_5_5 place_5_6)
        (conn place_7_4 place_7_3)
        (conn place_2_0 place_2_1)
        (conn place_4_3 place_4_2)
        (conn place_9_4 place_8_4)
        (conn place_4_8 place_4_9)
        (conn place_7_5 place_7_6)
        (conn place_2_1 place_2_2)
        (conn place_8_6 place_8_7)
        (conn place_1_0 place_0_0)
        (conn place_1_5 place_1_6)
        (conn place_0_3 place_0_4)
        (conn place_0_4 place_0_5)
        (conn place_1_3 place_1_2)
        (conn place_6_0 place_5_0)
        (conn place_1_3 place_1_4)
        (conn place_9_2 place_9_1)
        (conn place_7_2 place_7_1)
        (conn place_4_7 place_4_8)
        (conn place_0_6 place_0_7)
        (conn place_3_8 place_3_7)
        (conn place_6_3 place_6_4)
        (conn place_6_7 place_7_7)
        (conn place_7_0 place_6_0)
        (conn place_9_7 place_9_8)
        (conn place_4_2 place_5_2)
        (conn place_9_7 place_9_6)
        (conn place_1_1 place_1_0)
        (conn place_4_4 place_5_4)
        (conn place_7_0 place_7_1)
        (conn place_8_5 place_8_6)
        (conn place_1_7 place_1_8)
        (conn place_6_8 place_6_7)
        (conn place_3_5 place_3_6)
        (conn place_3_8 place_3_9)
        (conn place_8_3 place_8_4)
        (conn place_8_8 place_8_9)
        (conn place_9_1 place_9_0)
        (conn place_2_0 place_3_0)
        (conn place_9_4 place_9_5)
        (conn place_5_2 place_4_2)
        (conn place_6_2 place_6_3)
        (conn place_9_0 place_9_1)
        (conn place_3_8 place_2_8)
        (conn place_3_2 place_3_3)
        (conn place_6_3 place_7_3)
        (conn place_5_7 place_5_8)
        (conn place_6_1 place_6_2)
        (conn place_3_9 place_3_8)
        (conn place_6_4 place_6_3)
        (conn place_6_0 place_6_1)
        (conn place_3_6 place_3_7)
        (conn place_1_5 place_0_5)
        (conn place_3_6 place_2_6)
        (conn place_2_6 place_2_5)
        (conn place_1_9 place_1_8)
        (conn place_4_2 place_4_1)
        (conn place_6_6 place_6_7)
        (conn place_6_3 place_6_2)
        (conn place_0_1 place_1_1)
        (conn place_0_2 place_0_3)
        (conn place_3_1 place_2_1)
        (conn place_9_8 place_8_8)
        (conn place_7_4 place_7_5)
        (conn place_3_3 place_2_3)
        (conn place_0_3 place_0_2)
        (conn place_4_2 place_4_3)
        (conn place_6_5 place_7_5)
        (conn place_0_5 place_1_5)
        (conn place_3_4 place_3_3)
        (conn place_2_4 place_2_3)
        (open place_1_3)
        (open place_3_6)
        (open place_6_7)
        (open place_4_2)
        (open place_8_8)
        (open place_1_9)
        (open place_5_6)
        (open place_5_7)
        (open place_4_5)
        (open place_3_3)
        (open place_0_0)
        (open place_4_6)
        (open place_2_8)
        (open place_6_1)
        (open place_7_9)
        (open place_7_3)
        (open place_9_4)
        (open place_9_7)
        (open place_8_2)
        (open place_9_1)
        (open place_7_8)
        (open place_3_8)
        (open place_0_9)
        (open place_6_2)
        (open place_6_8)
        (open place_6_5)
        (open place_4_1)
        (open place_8_7)
        (open place_0_4)
        (open place_0_3)
        (open place_4_9)
        (open place_3_1)
        (open place_7_6)
        (open place_5_1)
        (open place_2_5)
        (open place_3_9)
        (open place_6_0)
        (open place_2_1)
        (open place_3_5)
        (open place_4_4)
        (open place_6_9)
        (open place_7_5)
        (open place_1_8)
        (open place_9_9)
        (open place_1_2)
        (open place_1_4)
        (open place_6_3)
        (open place_4_0)
        (open place_5_9)
        (open place_8_0)
        (open place_3_2)
        (open place_0_2)
        (open place_0_1)
        (open place_5_4)
        (open place_3_0)
        (open place_1_6)
        (open place_6_6)
        (open place_8_4)
        (open place_8_9)
        (open place_4_8)
        (open place_7_4)
        (open place_5_8)
        (open place_2_4)
        (open place_1_5)
        (open place_9_5)
        (open place_5_0)
        (open place_5_3)
        (open place_4_7)
        (open place_0_7)
        (open place_0_8)
        (open place_1_7)
        (open place_7_0)
        (open place_7_2)
        (open place_9_2)
        (open place_7_7)
        (open place_1_0)
        (open place_2_3)
        (open place_8_6)
        (locked place_0_5)
        (locked place_2_0)
        (locked place_9_8)
        (locked place_9_6)
        (locked place_9_3)
        (locked place_3_7)
        (locked place_2_7)
        (locked place_2_6)
        (locked place_6_4)
        (locked place_4_3)
        (locked place_3_4)
        (locked place_5_2)
        (locked place_8_1)
        (locked place_1_1)
        (locked place_5_5)
        (locked place_7_1)
        (locked place_9_0)
        (locked place_2_2)
        (locked place_2_9)
        (locked place_8_5)
        (locked place_8_3)
        (locked place_0_6)
        (lock-shape place_3_4 shape_13)
        (lock-shape place_2_6 shape_3)
        (lock-shape place_9_3 shape_1)
        (lock-shape place_9_0 shape_19)
        (lock-shape place_1_1 shape_11)
        (lock-shape place_3_7 shape_4)
        (lock-shape place_6_4 shape_16)
        (lock-shape place_9_8 shape_20)
        (lock-shape place_2_2 shape_9)
        (lock-shape place_2_7 shape_5)
        (lock-shape place_7_1 shape_17)
        (lock-shape place_8_5 shape_18)
        (lock-shape place_0_5 shape_7)
        (lock-shape place_5_2 shape_8)
        (lock-shape place_8_1 shape_2)
        (lock-shape place_5_5 shape_15)
        (lock-shape place_8_3 shape_6)
        (lock-shape place_2_9 shape_12)
        (lock-shape place_4_3 shape_14)
        (lock-shape place_2_0 shape_10)
        (lock-shape place_0_6 shape_0)
        (lock-shape place_9_6 shape_21)
        (at key_20 place_0_0)
        (at key_14 place_4_1)
        (at key_18 place_8_0)
        (at key_15 place_5_2)
        (at key_11 place_1_3)
        (at key_21 place_0_0)
        (at key_13 place_3_6)
        (at key_8 place_7_0)
        (at key_0 place_0_0)
        (at key_17 place_7_7)
        (at key_2 place_7_0)
        (at key_23 place_0_1)
        (at key_10 place_0_8)
        (at key_6 place_2_0)
        (at key_19 place_9_1)
        (at key_3 place_9_0)
        (at key_7 place_5_0)
        (at key_1 place_9_0)
        (at key_16 place_6_3)
        (at key_5 place_9_0)
        (at key_9 place_7_0)
        (at key_12 place_2_4)
        (at key_4 place_6_0)
        (at key_22 place_0_2)
        (key-shape key_14 shape_14)
        (key-shape key_8 shape_8)
        (key-shape key_5 shape_5)
        (key-shape key_2 shape_2)
        (key-shape key_1 shape_1)
        (key-shape key_19 shape_19)
        (key-shape key_0 shape_0)
        (key-shape key_7 shape_7)
        (key-shape key_18 shape_18)
        (key-shape key_17 shape_17)
        (key-shape key_20 shape_20)
        (key-shape key_22 shape_22)
        (key-shape key_16 shape_16)
        (key-shape key_23 shape_23)
        (key-shape key_6 shape_6)
        (key-shape key_21 shape_21)
        (key-shape key_4 shape_4)
        (key-shape key_13 shape_13)
        (key-shape key_9 shape_9)
        (key-shape key_15 shape_15)
        (key-shape key_3 shape_3)
        (key-shape key_12 shape_12)
        (key-shape key_10 shape_10)
        (key-shape key_11 shape_11)
    )

    (:goal
        (at-robot place_4_9)
    )

    
    
    
)

; plan
1. (move place_0_0 place_0_1)
   deleted: (at-robot place_0_0)
   added: (at-robot place_0_1)
   goals met: 0 of 1
2. (move place_0_1 place_0_2)
   deleted: (at-robot place_0_1)
   added: (at-robot place_0_2)
   goals met: 0 of 1
3. (move place_0_2 place_0_3)
   deleted: (at-robot place_0_2)
   added: (at-robot place_0_3)
   goals met: 0 of 1
4. (move place_0_3 place_1_3)
   deleted: (at-robot place_0_3)
   added: (at-robot place_1_3)
   goals met: 0 of 1
5. (move place_1_3 place_1_4)
   deleted: (at-robot place_1_3)
   added: (at-robot place_1_4)
   goals met: 0 of 1
6. (move place_1_4 place_1_5)
   deleted: (at-robot place_1_4)
   added: (at-robot place_1_5)
   goals met: 0 of 1
7. (move place_1_5 place_1_6)
   deleted: (at-robot place_1_5)
   added: (at-robot place_1_6)
   goals met: 0 of 1
8. (move place_1_6 place_1_7)
   deleted: (at-robot place_1_6)
   added: (at-robot place_1_7)
   goals met: 0 of 1
9. (move place_1_7 place_1_8)
   deleted: (at-robot place_1_7)
   added: (at-robot place_1_8)
   goals met: 0 of 1
10. (move place_1_8 place_0_8)
   deleted: (at-robot place_1_8)
   added: (at-robot place_0_8)
   goals met: 0 of 1
11. (pickup place_0_8 key_10)
   deleted: (at key_10 place_0_8)
   added: (carrying key_10)
   goals met: 0 of 1
12. (move place_0_8 place_1_8)
   deleted: (at-robot place_0_8)
   added: (at-robot place_1_8)
   goals met: 0 of 1
13. (move place_1_8 place_1_7)
   deleted: (at-robot place_1_8)
   added: (at-robot place_1_7)
   goals met: 0 of 1
14. (move place_1_7 place_1_6)
   deleted: (at-robot place_1_7)
   added: (at-robot place_1_6)
   goals met: 0 of 1
15. (move place_1_6 place_1_5)
   deleted: (at-robot place_1_6)
   added: (at-robot place_1_5)
   goals met: 0 of 1
16. (move place_1_5 place_1_4)
   deleted: (at-robot place_1_5)
   added: (at-robot place_1_4)
   goals met: 0 of 1
17. (move place_1_4 place_1_3)
   deleted: (at-robot place_1_4)
   added: (at-robot place_1_3)
   goals met: 0 of 1
18. (pickup place_1_3 key_11)
   deleted: (at key_11 place_1_3)
   added: (carrying key_11)
   goals met: 0 of 1
19. (move place_1_3 place_1_2)
   deleted: (at-robot place_1_3)
   added: (at-robot place_1_2)
   goals met: 0 of 1
20. (unlock place_1_2 place_1_1 key_11 shape_11)
   deleted: (locked place_1_1)
   added: (open place_1_1)
   goals met: 0 of 1
21. (move place_1_2 place_1_1)
   deleted: (at-robot place_1_2)
   added: (at-robot place_1_1)
   goals met: 0 of 1
22. (move place_1_1 place_1_0)
   deleted: (at-robot place_1_1)
   added: (at-robot place_1_0)
   goals met: 0 of 1
23. (unlock place_1_0 place_2_0 key_10 shape_10)
   deleted: (locked place_2_0)
   added: (open place_2_0)
   goals met: 0 of 1
24. (move place_1_0 place_2_0)
   deleted: (at-robot place_1_0)
   added: (at-robot place_2_0)
   goals met: 0 of 1
25. (move place_2_0 place_3_0)
   deleted: (at-robot place_2_0)
   added: (at-robot place_3_0)
   goals met: 0 of 1
26. (move place_3_0 place_4_0)
   deleted: (at-robot place_3_0)
   added: (at-robot place_4_0)
   goals met: 0 of 1
27. (move place_4_0 place_4_1)
   deleted: (at-robot place_4_0)
   added: (at-robot place_4_1)
   goals met: 0 of 1
28. (pickup place_4_1 key_14)
   deleted: (at key_14 place_4_1)
   added: (carrying key_14)
   goals met: 0 of 1
29. (move place_4_1 place_4_2)
   deleted: (at-robot place_4_1)
   added: (at-robot place_4_2)
   goals met: 0 of 1
30. (unlock place_4_2 place_4_3 key_14 shape_14)
   deleted: (locked place_4_3)
   added: (open place_4_3)
   goals met: 0 of 1
31. (move place_4_2 place_4_3)
   deleted: (at-robot place_4_2)
   added: (at-robot place_4_3)
   goals met: 0 of 1
32. (move place_4_3 place_4_4)
   deleted: (at-robot place_4_3)
   added: (at-robot place_4_4)
   goals met: 0 of 1
33. (move place_4_4 place_4_5)
   deleted: (at-robot place_4_4)
   added: (at-robot place_4_5)
   goals met: 0 of 1
34. (move place_4_5 place_4_6)
   deleted: (at-robot place_4_5)
   added: (at-robot place_4_6)
   goals met: 0 of 1
35. (move place_4_6 place_4_7)
   deleted: (at-robot place_4_6)
   added: (at-robot place_4_7)
   goals met: 0 of 1
36. (move place_4_7 place_4_8)
   deleted: (at-robot place_4_7)
   added: (at-robot place_4_8)
   goals met: 0 of 1
37. (move place_4_8 place_4_9)
   deleted: (at-robot place_4_8)
   added: (at-robot place_4_9)
   goals met: 1 of 1
